# Series & DataFrame
- 판다스는 엑셀의 파이썬 형태
- `엑셀은 table 형태로` 데이터를 저장
- 판다스에서는 이 table을 `DataFrame`이라고 한다.
- `DataFrame`은 여러개의 `Series`의 결합으로 구성된다.

In [17]:
import pandas as pd
import numpy as np

nums = [i for i in range(1,11)]
print(nums)

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

# Series 데이터를 생성하는 방법

In [22]:
seriesNums = pd.Series(nums)
print(seriesNums)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

## Series Data 사용법

In [33]:
seriesNums.mean()
# Series의 data의 mean값

5.5

In [35]:
seriesNums.describe()

count    10.00000
mean      5.50000
std       3.02765
min       1.00000
25%       3.25000
50%       5.50000
75%       7.75000
max      10.00000
dtype: float64

# DataFrame을 생성하는 방법

In [47]:
nums = [
    [1,2,3],
    [4,5,6],
    [7,8,9]
]
nums

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [49]:
dfNums = pd.DataFrame(nums)
dfNums

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

### 여러개의 시리즈를 합친 것이 DataFrame

In [62]:
dfNums[0]

0    1
1    4
2    7
Name: 0, dtype: int64

In [68]:
print(type(dfNums))
print(type(dfNums[0]))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

## DataFrame Create by using list

In [72]:
users=[
    ['대호',174,13],
    ['수현',178,18],
    ['남기',172,11],
]
users

[['대호', 174, 13], ['수현', 178, 18], ['남기', 172, 11]]

In [76]:
dfUsers = pd.DataFrame(users)
dfUsers

    0    1   2
0  대호  174  13
1  수현  178  18
2  남기  172  11

In [78]:
dfUsers.columns=["name","height","length"]
dfUsers

  name  height  length
0   대호     174      13
1   수현     178      18
2   남기     172      11

## DataFrame Create by using Dictionary

In [104]:
usersDict ={
    "name":["남수","영민","재혁"],
    "height":[165,182,173],
    "length":[13,15,12]
}
usersDict

{'name': ['남수', '영민', '재혁'], 'height': [165, 182, 173], 'length': [13, 15, 12]}

In [106]:
dfUsersDict=pd.DataFrame(usersDict)
dfUsersDict

  name  height  length
0   남수     165      13
1   영민     182      15
2   재혁     173      12

# ** api 응답결과로 list in dict 형태의 데이터 포맷으로 올 가능성이 크다.

In [115]:
newUsers =[
    {"name":'창명',"height":176,"age":30},
    {"name":'성현',"height":180,"age":30},
    {"name":'강철',"height":177,"age":30},
]
newUsers

[{'name': '창명', 'height': 176, 'age': 30},
 {'name': '성현', 'height': 180, 'age': 30},
 {'name': '강철', 'height': 177, 'age': 30}]

In [119]:
dfNewUsers = pd.DataFrame(newUsers)
dfNewUsers

  name  height  age
0   창명     176   30
1   성현     180   30
2   강철     177   30